Revit 2027 API
ViewCropRegionShapeManager.GetSplitRegionMinimum Method
 Returns the proportional location of the minimum boundary of the specified split crop region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetSplitRegionMinimum(
	int regionIndex
)
Public Function GetSplitRegionMinimum (
	regionIndex As Integer
) As Double
public:
double GetSplitRegionMinimum(
	int regionIndex
)
member GetSplitRegionMinimum :
        regionIndex : int -> float
Parameters
regionIndex Int32
 Index of split crop region (numbering starts with 0).
Return Value
Double
 A value from 0 to 1 representing the minimum location for the region's split boundary. This number represents the location as a ratio along the non-split rectangular crop.
Exceptions
Exception | Condition
ArgumentException |  The provided region index is invalid.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace